controllers/SiteController.php

SELECT * FROM `diapos_carrusel`
---
    public function actionIndex()
    {
        $cursos = [];
        try
        {
            $cursos = Producto::findBySql('select * from `producto` order by id desc limit 6')->all();
            $diapos = \app\models\DiaposCarrusel::find()->all();